Product - Investment Income Reporting/Product - DWT/sample messages/DWTFileRequestUpdate_PeriodEndDate.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ret="https://services.ird.govt.nz/GWS/Returns/" xmlns:fil="https://services.ird.govt.nz/GWS/Returns/:types/FileRequest" xmlns:a="http://www.w3.org/2005/08/addressing">
    <soap:Header>
        <a:Action>https://services.ird.govt.nz/GWS/Returns/Return/File</a:Action>
    </soap:Header>
    <soap:Body>
        <ret:File>
            <ret:ReturnFileRequestMsg>
                <fil:FileRequestWrapper>
                    <r:fileRequest xmlns:cmn="urn:www.ird.govt.nz/GWS:types/Common.v2" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:r="urn:www.ird.govt.nz/GWS:types/ReturnDWT.v1" xmlns:rc="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v2">
                        <rc:fileHeader>
                            <cmn:softwareProviderData>
                                <cmn:softwareProvider>SoftwareProvider Company Ltd</cmn:softwareProvider>
                                <cmn:softwarePlatform>SoftwarePlatform</cmn:softwarePlatform>
                                <cmn:softwareRelease>1.0</cmn:softwareRelease>
                            </cmn:softwareProviderData>
                            <cmn:identifier IdentifierValueType="IRD">012501250</cmn:identifier>
                            <cmn:accountType>DWT</cmn:accountType>
                            <rc:periodEndDate>2019-04-30</rc:periodEndDate>
                            <rc:majorFormType>DWT</rc:majorFormType>
                            <rc:minorFormType>DWT</rc:minorFormType>
                        </rc:fileHeader>
                        <rc:fileBody>
                            <rc:standardFields>
                                <rc:isNilReturn>false</rc:isNilReturn>
                                <rc:isFinalReturn>false</rc:isFinalReturn>
                                <rc:amendmentRequest>
                                    <rc:isAmended>true</rc:isAmended>
                                    <rc:amendReason>KEY</rc:amendReason>
                                    <rc:amendDetails>Error in imputation amount paid.</rc:amendDetails>
                                </rc:amendmentRequest>
                            </rc:standardFields>
                            <rc:formFields xsi:type="r:FormFieldsType">
                                <r:isReverseReplace>false</r:isReverseReplace>
                                <r:lineItems>
                                    <r:referenceId>LineItemAB</r:referenceId>
                                    <r:amendType>U</r:amendType>
                                    <r:externalID>BankAccountXYY</r:externalID>
                                    <r:primaryIRD>012301235</r:primaryIRD>
                                    <r:primaryDateOfBirth>1980-11-01</r:primaryDateOfBirth>
                                    <r:primaryName>Kyle Brown</r:primaryName>
                                    <r:primaryPhone>0429392939</r:primaryPhone>
                                    <r:primaryEmail>name2@bcompany.co.nz</r:primaryEmail>
                                    <r:primaryCountry>NZ</r:primaryCountry>
                                    <r:primaryAddress>123 Browns St, Suburb, City 0000</r:primaryAddress>
                                    <r:numberShares>75</r:numberShares>
                                    <r:paymentDate>2019-04-25</r:paymentDate>
                                    <r:dividendDeclaredDate>2019-04-01</r:dividendDeclaredDate>
                                    <r:bonusIssue>false</r:bonusIssue>
                                    <r:incomeInformation>
                                        <rc:grossAmount>2200.00</rc:grossAmount>
                                        <rc:deductedAmount>176.00</rc:deductedAmount>
                                        <rc:rate>33.00</rc:rate>
                                        <r:imputationCredits>550.00</r:imputationCredits>
                                        <r:creditRatio>25.00</r:creditRatio>
                                        <r:australianDividendsPaid>false</r:australianDividendsPaid>
                                        <r:australianExchangeRate>0</r:australianExchangeRate>
                                    </r:incomeInformation>
                                </r:lineItems>
                            </rc:formFields>
                        </rc:fileBody>
                    </r:fileRequest>
                </fil:FileRequestWrapper>
            </ret:ReturnFileRequestMsg>
        </ret:File>
    </soap:Body>
</soap:Envelope>